MikroElektronika/core_packages/PIC/XC8/def/PIC16F1579/mcu.h
// Register: PWM2PRH
#define PWM2PRH PWM2PRH
extern volatile unsigned char           PWM2PRH             __at(0xDA6);
#ifndef _LIB_BUILD
asm("PWM2PRH equ 0DA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM2PRH0               :1;
        unsigned PWM2PRH1               :1;
        unsigned PWM2PRH2               :1;
        unsigned PWM2PRH3               :1;
        unsigned PWM2PRH4               :1;
        unsigned PWM2PRH5               :1;
        unsigned PWM2PRH6               :1;
        unsigned PWM2PRH7               :1;
    };
    struct {
        unsigned PWM2PRH                :8;
    };
} PWM2PRHbits_t;
extern volatile PWM2PRHbits_t PWM2PRHbits __at(0xDA6);
// bitfield macros
#define _PWM2PRH_PR_POSN                                    0x0
#define _PWM2PRH_PR_POSITION                                0x0
#define _PWM2PRH_PR_SIZE                                    0x8
#define _PWM2PRH_PR_LENGTH                                  0x8
#define _PWM2PRH_PR_MASK                                    0xFF
#define _PWM2PRH_PWM2PRH0_POSN                              0x0
#define _PWM2PRH_PWM2PRH0_POSITION                          0x0
#define _PWM2PRH_PWM2PRH0_SIZE                              0x1
#define _PWM2PRH_PWM2PRH0_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH0_MASK                              0x1
#define _PWM2PRH_PWM2PRH1_POSN                              0x1
#define _PWM2PRH_PWM2PRH1_POSITION                          0x1
#define _PWM2PRH_PWM2PRH1_SIZE                              0x1
#define _PWM2PRH_PWM2PRH1_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH1_MASK                              0x2
#define _PWM2PRH_PWM2PRH2_POSN                              0x2
#define _PWM2PRH_PWM2PRH2_POSITION                          0x2
#define _PWM2PRH_PWM2PRH2_SIZE                              0x1
#define _PWM2PRH_PWM2PRH2_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH2_MASK                              0x4
#define _PWM2PRH_PWM2PRH3_POSN                              0x3
#define _PWM2PRH_PWM2PRH3_POSITION                          0x3
#define _PWM2PRH_PWM2PRH3_SIZE                              0x1
#define _PWM2PRH_PWM2PRH3_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH3_MASK                              0x8
#define _PWM2PRH_PWM2PRH4_POSN                              0x4
#define _PWM2PRH_PWM2PRH4_POSITION                          0x4
#define _PWM2PRH_PWM2PRH4_SIZE                              0x1
#define _PWM2PRH_PWM2PRH4_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH4_MASK                              0x10
#define _PWM2PRH_PWM2PRH5_POSN                              0x5
#define _PWM2PRH_PWM2PRH5_POSITION                          0x5
#define _PWM2PRH_PWM2PRH5_SIZE                              0x1
#define _PWM2PRH_PWM2PRH5_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH5_MASK                              0x20
#define _PWM2PRH_PWM2PRH6_POSN                              0x6
#define _PWM2PRH_PWM2PRH6_POSITION                          0x6
#define _PWM2PRH_PWM2PRH6_SIZE                              0x1
#define _PWM2PRH_PWM2PRH6_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH6_MASK                              0x40
#define _PWM2PRH_PWM2PRH7_POSN                              0x7
#define _PWM2PRH_PWM2PRH7_POSITION                          0x7
#define _PWM2PRH_PWM2PRH7_SIZE                              0x1
#define _PWM2PRH_PWM2PRH7_LENGTH                            0x1
#define _PWM2PRH_PWM2PRH7_MASK                              0x80
#define _PWM2PRH_PWM2PRH_POSN                               0x0
#define _PWM2PRH_PWM2PRH_POSITION                           0x0
#define _PWM2PRH_PWM2PRH_SIZE                               0x8
#define _PWM2PRH_PWM2PRH_LENGTH                             0x8
#define _PWM2PRH_PWM2PRH_MASK                               0xFF

// Register: PWM2OF
#define PWM2OF PWM2OF
extern volatile unsigned short          PWM2OF              __at(0xDA7);
#ifndef _LIB_BUILD
asm("PWM2OF equ 0DA7h");
#endif

// Register: PWM2OFL
#define PWM2OFL PWM2OFL
extern volatile unsigned char           PWM2OFL             __at(0xDA7);
#ifndef _LIB_BUILD
asm("PWM2OFL equ 0DA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM2OFL0               :1;
        unsigned PWM2OFL1               :1;
        unsigned PWM2OFL2               :1;
        unsigned PWM2OFL3               :1;
        unsigned PWM2OFL4               :1;
        unsigned PWM2OFL5               :1;
        unsigned PWM2OFL6               :1;
        unsigned PWM2OFL7               :1;
    };
    struct {
        unsigned PWM2OFL                :8;
    };
} PWM2OFLbits_t;
extern volatile PWM2OFLbits_t PWM2OFLbits __at(0xDA7);
// bitfield macros
#define _PWM2OFL_OF_POSN                                    0x0
#define _PWM2OFL_OF_POSITION                                0x0
#define _PWM2OFL_OF_SIZE                                    0x8
#define _PWM2OFL_OF_LENGTH                                  0x8
#define _PWM2OFL_OF_MASK                                    0xFF
#define _PWM2OFL_PWM2OFL0_POSN                              0x0
#define _PWM2OFL_PWM2OFL0_POSITION                          0x0
#define _PWM2OFL_PWM2OFL0_SIZE                              0x1
#define _PWM2OFL_PWM2OFL0_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL0_MASK                              0x1
#define _PWM2OFL_PWM2OFL1_POSN                              0x1
#define _PWM2OFL_PWM2OFL1_POSITION                          0x1
#define _PWM2OFL_PWM2OFL1_SIZE                              0x1
#define _PWM2OFL_PWM2OFL1_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL1_MASK                              0x2
#define _PWM2OFL_PWM2OFL2_POSN                              0x2
#define _PWM2OFL_PWM2OFL2_POSITION                          0x2
#define _PWM2OFL_PWM2OFL2_SIZE                              0x1
#define _PWM2OFL_PWM2OFL2_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL2_MASK                              0x4
#define _PWM2OFL_PWM2OFL3_POSN                              0x3
#define _PWM2OFL_PWM2OFL3_POSITION                          0x3
#define _PWM2OFL_PWM2OFL3_SIZE                              0x1
#define _PWM2OFL_PWM2OFL3_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL3_MASK                              0x8
#define _PWM2OFL_PWM2OFL4_POSN                              0x4
#define _PWM2OFL_PWM2OFL4_POSITION                          0x4
#define _PWM2OFL_PWM2OFL4_SIZE                              0x1
#define _PWM2OFL_PWM2OFL4_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL4_MASK                              0x10
#define _PWM2OFL_PWM2OFL5_POSN                              0x5
#define _PWM2OFL_PWM2OFL5_POSITION                          0x5
#define _PWM2OFL_PWM2OFL5_SIZE                              0x1
#define _PWM2OFL_PWM2OFL5_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL5_MASK                              0x20
#define _PWM2OFL_PWM2OFL6_POSN                              0x6
#define _PWM2OFL_PWM2OFL6_POSITION                          0x6
#define _PWM2OFL_PWM2OFL6_SIZE                              0x1
#define _PWM2OFL_PWM2OFL6_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL6_MASK                              0x40
#define _PWM2OFL_PWM2OFL7_POSN                              0x7
#define _PWM2OFL_PWM2OFL7_POSITION                          0x7
#define _PWM2OFL_PWM2OFL7_SIZE                              0x1
#define _PWM2OFL_PWM2OFL7_LENGTH                            0x1
#define _PWM2OFL_PWM2OFL7_MASK                              0x80
#define _PWM2OFL_PWM2OFL_POSN                               0x0
#define _PWM2OFL_PWM2OFL_POSITION                           0x0
#define _PWM2OFL_PWM2OFL_SIZE                               0x8
#define _PWM2OFL_PWM2OFL_LENGTH                             0x8
#define _PWM2OFL_PWM2OFL_MASK                               0xFF

