MikroElektronika/core_packages/PIC/XC8/def/PIC16F1579/mcu.h
#define                                 PWM2PRL0_bit        _BIT_ACCESS(PWM2PRL,0)
// PWM2PRL<PWM2PRL1>
extern volatile __bit                   PWM2PRL1            __at(0x6D29);	// @ (0xDA5 * 8 + 1)
#define                                 PWM2PRL1_bit        _BIT_ACCESS(PWM2PRL,1)
// PWM2PRL<PWM2PRL2>
extern volatile __bit                   PWM2PRL2            __at(0x6D2A);	// @ (0xDA5 * 8 + 2)
#define                                 PWM2PRL2_bit        _BIT_ACCESS(PWM2PRL,2)
// PWM2PRL<PWM2PRL3>
extern volatile __bit                   PWM2PRL3            __at(0x6D2B);	// @ (0xDA5 * 8 + 3)
#define                                 PWM2PRL3_bit        _BIT_ACCESS(PWM2PRL,3)
// PWM2PRL<PWM2PRL4>
extern volatile __bit                   PWM2PRL4            __at(0x6D2C);	// @ (0xDA5 * 8 + 4)
#define                                 PWM2PRL4_bit        _BIT_ACCESS(PWM2PRL,4)
// PWM2PRL<PWM2PRL5>
extern volatile __bit                   PWM2PRL5            __at(0x6D2D);	// @ (0xDA5 * 8 + 5)
#define                                 PWM2PRL5_bit        _BIT_ACCESS(PWM2PRL,5)
// PWM2PRL<PWM2PRL6>
extern volatile __bit                   PWM2PRL6            __at(0x6D2E);	// @ (0xDA5 * 8 + 6)
#define                                 PWM2PRL6_bit        _BIT_ACCESS(PWM2PRL,6)
// PWM2PRL<PWM2PRL7>
extern volatile __bit                   PWM2PRL7            __at(0x6D2F);	// @ (0xDA5 * 8 + 7)
#define                                 PWM2PRL7_bit        _BIT_ACCESS(PWM2PRL,7)
// PWM2CLKCON<PWM2PS0>
extern volatile __bit                   PWM2PS0             __at(0x6D74);	// @ (0xDAE * 8 + 4)
#define                                 PWM2PS0_bit         _BIT_ACCESS(PWM2CLKCON,4)
// PWM2CLKCON<PWM2PS1>
extern volatile __bit                   PWM2PS1             __at(0x6D75);	// @ (0xDAE * 8 + 5)
#define                                 PWM2PS1_bit         _BIT_ACCESS(PWM2CLKCON,5)
// PWM2CLKCON<PWM2PS2>
extern volatile __bit                   PWM2PS2             __at(0x6D76);	// @ (0xDAE * 8 + 6)
#define                                 PWM2PS2_bit         _BIT_ACCESS(PWM2CLKCON,6)
// PWM2TMRH<PWM2TMRH0>
extern volatile __bit                   PWM2TMRH0           __at(0x6D50);	// @ (0xDAA * 8 + 0)
#define                                 PWM2TMRH0_bit       _BIT_ACCESS(PWM2TMRH,0)
// PWM2TMRH<PWM2TMRH1>
extern volatile __bit                   PWM2TMRH1           __at(0x6D51);	// @ (0xDAA * 8 + 1)
#define                                 PWM2TMRH1_bit       _BIT_ACCESS(PWM2TMRH,1)
// PWM2TMRH<PWM2TMRH2>
extern volatile __bit                   PWM2TMRH2           __at(0x6D52);	// @ (0xDAA * 8 + 2)
#define                                 PWM2TMRH2_bit       _BIT_ACCESS(PWM2TMRH,2)
// PWM2TMRH<PWM2TMRH3>
extern volatile __bit                   PWM2TMRH3           __at(0x6D53);	// @ (0xDAA * 8 + 3)
#define                                 PWM2TMRH3_bit       _BIT_ACCESS(PWM2TMRH,3)
// PWM2TMRH<PWM2TMRH4>
extern volatile __bit                   PWM2TMRH4           __at(0x6D54);	// @ (0xDAA * 8 + 4)
#define                                 PWM2TMRH4_bit       _BIT_ACCESS(PWM2TMRH,4)
// PWM2TMRH<PWM2TMRH5>
extern volatile __bit                   PWM2TMRH5           __at(0x6D55);	// @ (0xDAA * 8 + 5)
#define                                 PWM2TMRH5_bit       _BIT_ACCESS(PWM2TMRH,5)
// PWM2TMRH<PWM2TMRH6>
extern volatile __bit                   PWM2TMRH6           __at(0x6D56);	// @ (0xDAA * 8 + 6)
#define                                 PWM2TMRH6_bit       _BIT_ACCESS(PWM2TMRH,6)
// PWM2TMRH<PWM2TMRH7>
extern volatile __bit                   PWM2TMRH7           __at(0x6D57);	// @ (0xDAA * 8 + 7)
#define                                 PWM2TMRH7_bit       _BIT_ACCESS(PWM2TMRH,7)
// PWM2TMRL<PWM2TMRL0>
extern volatile __bit                   PWM2TMRL0           __at(0x6D48);	// @ (0xDA9 * 8 + 0)
#define                                 PWM2TMRL0_bit       _BIT_ACCESS(PWM2TMRL,0)
// PWM2TMRL<PWM2TMRL1>
extern volatile __bit                   PWM2TMRL1           __at(0x6D49);	// @ (0xDA9 * 8 + 1)
#define                                 PWM2TMRL1_bit       _BIT_ACCESS(PWM2TMRL,1)
// PWM2TMRL<PWM2TMRL2>
extern volatile __bit                   PWM2TMRL2           __at(0x6D4A);	// @ (0xDA9 * 8 + 2)
#define                                 PWM2TMRL2_bit       _BIT_ACCESS(PWM2TMRL,2)
// PWM2TMRL<PWM2TMRL3>
extern volatile __bit                   PWM2TMRL3           __at(0x6D4B);	// @ (0xDA9 * 8 + 3)
#define                                 PWM2TMRL3_bit       _BIT_ACCESS(PWM2TMRL,3)
// PWM2TMRL<PWM2TMRL4>
extern volatile __bit                   PWM2TMRL4           __at(0x6D4C);	// @ (0xDA9 * 8 + 4)
#define                                 PWM2TMRL4_bit       _BIT_ACCESS(PWM2TMRL,4)
// PWM2TMRL<PWM2TMRL5>
extern volatile __bit                   PWM2TMRL5           __at(0x6D4D);	// @ (0xDA9 * 8 + 5)
#define                                 PWM2TMRL5_bit       _BIT_ACCESS(PWM2TMRL,5)
// PWM2TMRL<PWM2TMRL6>
extern volatile __bit                   PWM2TMRL6           __at(0x6D4E);	// @ (0xDA9 * 8 + 6)
#define                                 PWM2TMRL6_bit       _BIT_ACCESS(PWM2TMRL,6)
// PWM2TMRL<PWM2TMRL7>
extern volatile __bit                   PWM2TMRL7           __at(0x6D4F);	// @ (0xDA9 * 8 + 7)
#define                                 PWM2TMRL7_bit       _BIT_ACCESS(PWM2TMRL,7)
// PWM3CLKCON<PWM3CS0>
extern volatile __bit                   PWM3CS0             __at(0x6DF0);	// @ (0xDBE * 8 + 0)
#define                                 PWM3CS0_bit         _BIT_ACCESS(PWM3CLKCON,0)
// PWM3CLKCON<PWM3CS1>
extern volatile __bit                   PWM3CS1             __at(0x6DF1);	// @ (0xDBE * 8 + 1)
#define                                 PWM3CS1_bit         _BIT_ACCESS(PWM3CLKCON,1)
// PWM3DCH<PWM3DCH0>
extern volatile __bit                   PWM3DCH0            __at(0x6DA0);	// @ (0xDB4 * 8 + 0)
#define                                 PWM3DCH0_bit        _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DCH1>
extern volatile __bit                   PWM3DCH1            __at(0x6DA1);	// @ (0xDB4 * 8 + 1)
#define                                 PWM3DCH1_bit        _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DCH2>
extern volatile __bit                   PWM3DCH2            __at(0x6DA2);	// @ (0xDB4 * 8 + 2)
#define                                 PWM3DCH2_bit        _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DCH3>
extern volatile __bit                   PWM3DCH3            __at(0x6DA3);	// @ (0xDB4 * 8 + 3)
#define                                 PWM3DCH3_bit        _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DCH4>
extern volatile __bit                   PWM3DCH4            __at(0x6DA4);	// @ (0xDB4 * 8 + 4)
#define                                 PWM3DCH4_bit        _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DCH5>
extern volatile __bit                   PWM3DCH5            __at(0x6DA5);	// @ (0xDB4 * 8 + 5)
#define                                 PWM3DCH5_bit        _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DCH6>
extern volatile __bit                   PWM3DCH6            __at(0x6DA6);	// @ (0xDB4 * 8 + 6)
#define                                 PWM3DCH6_bit        _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DCH7>
extern volatile __bit                   PWM3DCH7            __at(0x6DA7);	// @ (0xDB4 * 8 + 7)
#define                                 PWM3DCH7_bit        _BIT_ACCESS(PWM3DCH,7)
// PWM3INTE<PWM3DCIE>
extern volatile __bit                   PWM3DCIE            __at(0x6DE1);	// @ (0xDBC * 8 + 1)
#define                                 PWM3DCIE_bit        _BIT_ACCESS(PWM3INTE,1)
// PWM3INTF<PWM3DCIF>
extern volatile __bit                   PWM3DCIF            __at(0x6DE9);	// @ (0xDBD * 8 + 1)
#define                                 PWM3DCIF_bit        _BIT_ACCESS(PWM3INTF,1)
// PWM3DCL<PWM3DCL0>
extern volatile __bit                   PWM3DCL0            __at(0x6D98);	// @ (0xDB3 * 8 + 0)
#define                                 PWM3DCL0_bit        _BIT_ACCESS(PWM3DCL,0)
// PWM3DCL<PWM3DCL1>
extern volatile __bit                   PWM3DCL1            __at(0x6D99);	// @ (0xDB3 * 8 + 1)
#define                                 PWM3DCL1_bit        _BIT_ACCESS(PWM3DCL,1)
// PWM3DCL<PWM3DCL2>
extern volatile __bit                   PWM3DCL2            __at(0x6D9A);	// @ (0xDB3 * 8 + 2)
#define                                 PWM3DCL2_bit        _BIT_ACCESS(PWM3DCL,2)
// PWM3DCL<PWM3DCL3>
extern volatile __bit                   PWM3DCL3            __at(0x6D9B);	// @ (0xDB3 * 8 + 3)
#define                                 PWM3DCL3_bit        _BIT_ACCESS(PWM3DCL,3)
// PWM3DCL<PWM3DCL4>
extern volatile __bit                   PWM3DCL4            __at(0x6D9C);	// @ (0xDB3 * 8 + 4)
#define                                 PWM3DCL4_bit        _BIT_ACCESS(PWM3DCL,4)
// PWM3DCL<PWM3DCL5>
extern volatile __bit                   PWM3DCL5            __at(0x6D9D);	// @ (0xDB3 * 8 + 5)
#define                                 PWM3DCL5_bit        _BIT_ACCESS(PWM3DCL,5)
// PWM3DCL<PWM3DCL6>
extern volatile __bit                   PWM3DCL6            __at(0x6D9E);	// @ (0xDB3 * 8 + 6)
#define                                 PWM3DCL6_bit        _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DCL7>
extern volatile __bit                   PWM3DCL7            __at(0x6D9F);	// @ (0xDB3 * 8 + 7)
#define                                 PWM3DCL7_bit        _BIT_ACCESS(PWM3DCL,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x6DDF);	// @ (0xDBB * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWMEN<PWM3EN_A>
extern volatile __bit                   PWM3EN_A            __at(0x6C72);	// @ (0xD8E * 8 + 2)
#define                                 PWM3EN_A_bit        _BIT_ACCESS(PWMEN,2)
// PIE3<PWM3IE>
extern volatile __bit                   PWM3IE              __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 PWM3IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<PWM3IF>
extern volatile __bit                   PWM3IF              __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 PWM3IF_bit          _BIT_ACCESS(PIR3,6)
// PWM3LDCON<PWM3LD>
extern volatile __bit                   PWM3LD              __at(0x6DFF);	// @ (0xDBF * 8 + 7)
#define                                 PWM3LD_bit          _BIT_ACCESS(PWM3LDCON,7)
// PWMLD<PWM3LDA_A>
extern volatile __bit                   PWM3LDA_A           __at(0x6C7A);	// @ (0xD8F * 8 + 2)
#define                                 PWM3LDA_A_bit       _BIT_ACCESS(PWMLD,2)
// PWM3LDCON<PWM3LDM>
extern volatile __bit                   PWM3LDM             __at(0x6DFE);	// @ (0xDBF * 8 + 6)
#define                                 PWM3LDM_bit         _BIT_ACCESS(PWM3LDCON,6)
// PWM3LDCON<PWM3LDS0>
extern volatile __bit                   PWM3LDS0            __at(0x6DF8);	// @ (0xDBF * 8 + 0)
#define                                 PWM3LDS0_bit        _BIT_ACCESS(PWM3LDCON,0)
// PWM3LDCON<PWM3LDS1>
extern volatile __bit                   PWM3LDS1            __at(0x6DF9);	// @ (0xDBF * 8 + 1)
#define                                 PWM3LDS1_bit        _BIT_ACCESS(PWM3LDCON,1)
// PWM3CON<PWM3MODE0>
extern volatile __bit                   PWM3MODE0           __at(0x6DDA);	// @ (0xDBB * 8 + 2)
#define                                 PWM3MODE0_bit       _BIT_ACCESS(PWM3CON,2)
// PWM3CON<PWM3MODE1>
extern volatile __bit                   PWM3MODE1           __at(0x6DDB);	// @ (0xDBB * 8 + 3)
#define                                 PWM3MODE1_bit       _BIT_ACCESS(PWM3CON,3)
// PWM3CON<PWM3OE>
extern volatile __bit                   PWM3OE              __at(0x6DDE);	// @ (0xDBB * 8 + 6)
#define                                 PWM3OE_bit          _BIT_ACCESS(PWM3CON,6)
// PWM3OFH<PWM3OFH0>
extern volatile __bit                   PWM3OFH0            __at(0x6DC0);	// @ (0xDB8 * 8 + 0)
#define                                 PWM3OFH0_bit        _BIT_ACCESS(PWM3OFH,0)
// PWM3OFH<PWM3OFH1>
extern volatile __bit                   PWM3OFH1            __at(0x6DC1);	// @ (0xDB8 * 8 + 1)
#define                                 PWM3OFH1_bit        _BIT_ACCESS(PWM3OFH,1)
// PWM3OFH<PWM3OFH2>
extern volatile __bit                   PWM3OFH2            __at(0x6DC2);	// @ (0xDB8 * 8 + 2)
#define                                 PWM3OFH2_bit        _BIT_ACCESS(PWM3OFH,2)
// PWM3OFH<PWM3OFH3>
extern volatile __bit                   PWM3OFH3            __at(0x6DC3);	// @ (0xDB8 * 8 + 3)
#define                                 PWM3OFH3_bit        _BIT_ACCESS(PWM3OFH,3)
// PWM3OFH<PWM3OFH4>
extern volatile __bit                   PWM3OFH4            __at(0x6DC4);	// @ (0xDB8 * 8 + 4)
#define                                 PWM3OFH4_bit        _BIT_ACCESS(PWM3OFH,4)
// PWM3OFH<PWM3OFH5>
extern volatile __bit                   PWM3OFH5            __at(0x6DC5);	// @ (0xDB8 * 8 + 5)
#define                                 PWM3OFH5_bit        _BIT_ACCESS(PWM3OFH,5)
// PWM3OFH<PWM3OFH6>
extern volatile __bit                   PWM3OFH6            __at(0x6DC6);	// @ (0xDB8 * 8 + 6)
#define                                 PWM3OFH6_bit        _BIT_ACCESS(PWM3OFH,6)
// PWM3OFH<PWM3OFH7>
extern volatile __bit                   PWM3OFH7            __at(0x6DC7);	// @ (0xDB8 * 8 + 7)
#define                                 PWM3OFH7_bit        _BIT_ACCESS(PWM3OFH,7)
// PWM3INTE<PWM3OFIE>
extern volatile __bit                   PWM3OFIE            __at(0x6DE3);	// @ (0xDBC * 8 + 3)
#define                                 PWM3OFIE_bit        _BIT_ACCESS(PWM3INTE,3)
// PWM3INTF<PWM3OFIF>
extern volatile __bit                   PWM3OFIF            __at(0x6DEB);	// @ (0xDBD * 8 + 3)
#define                                 PWM3OFIF_bit        _BIT_ACCESS(PWM3INTF,3)
// PWM3OFL<PWM3OFL0>
extern volatile __bit                   PWM3OFL0            __at(0x6DB8);	// @ (0xDB7 * 8 + 0)
#define                                 PWM3OFL0_bit        _BIT_ACCESS(PWM3OFL,0)
// PWM3OFL<PWM3OFL1>
extern volatile __bit                   PWM3OFL1            __at(0x6DB9);	// @ (0xDB7 * 8 + 1)
#define                                 PWM3OFL1_bit        _BIT_ACCESS(PWM3OFL,1)
// PWM3OFL<PWM3OFL2>
extern volatile __bit                   PWM3OFL2            __at(0x6DBA);	// @ (0xDB7 * 8 + 2)
#define                                 PWM3OFL2_bit        _BIT_ACCESS(PWM3OFL,2)
// PWM3OFL<PWM3OFL3>
extern volatile __bit                   PWM3OFL3            __at(0x6DBB);	// @ (0xDB7 * 8 + 3)
#define                                 PWM3OFL3_bit        _BIT_ACCESS(PWM3OFL,3)
// PWM3OFL<PWM3OFL4>
extern volatile __bit                   PWM3OFL4            __at(0x6DBC);	// @ (0xDB7 * 8 + 4)
#define                                 PWM3OFL4_bit        _BIT_ACCESS(PWM3OFL,4)
// PWM3OFL<PWM3OFL5>
extern volatile __bit                   PWM3OFL5            __at(0x6DBD);	// @ (0xDB7 * 8 + 5)
#define                                 PWM3OFL5_bit        _BIT_ACCESS(PWM3OFL,5)
// PWM3OFL<PWM3OFL6>
extern volatile __bit                   PWM3OFL6            __at(0x6DBE);	// @ (0xDB7 * 8 + 6)
#define                                 PWM3OFL6_bit        _BIT_ACCESS(PWM3OFL,6)
// PWM3OFL<PWM3OFL7>
extern volatile __bit                   PWM3OFL7            __at(0x6DBF);	// @ (0xDB7 * 8 + 7)
#define                                 PWM3OFL7_bit        _BIT_ACCESS(PWM3OFL,7)
// PWM3OFCON<PWM3OFM0>
extern volatile __bit                   PWM3OFM0            __at(0x6E05);	// @ (0xDC0 * 8 + 5)
#define                                 PWM3OFM0_bit        _BIT_ACCESS(PWM3OFCON,5)
// PWM3OFCON<PWM3OFM1>
extern volatile __bit                   PWM3OFM1            __at(0x6E06);	// @ (0xDC0 * 8 + 6)
#define                                 PWM3OFM1_bit        _BIT_ACCESS(PWM3OFCON,6)
// PWM3OFCON<PWM3OFMC>
extern volatile __bit                   PWM3OFMC            __at(0x6E04);	// @ (0xDC0 * 8 + 4)
#define                                 PWM3OFMC_bit        _BIT_ACCESS(PWM3OFCON,4)
// PWM3OFCON<PWM3OFS0>
extern volatile __bit                   PWM3OFS0            __at(0x6E00);	// @ (0xDC0 * 8 + 0)
#define                                 PWM3OFS0_bit        _BIT_ACCESS(PWM3OFCON,0)
// PWM3OFCON<PWM3OFS1>
extern volatile __bit                   PWM3OFS1            __at(0x6E01);	// @ (0xDC0 * 8 + 1)
#define                                 PWM3OFS1_bit        _BIT_ACCESS(PWM3OFCON,1)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x6DDD);	// @ (0xDBB * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWMOUT<PWM3OUT_A>
extern volatile __bit                   PWM3OUT_A           __at(0x6C82);	// @ (0xD90 * 8 + 2)
#define                                 PWM3OUT_A_bit       _BIT_ACCESS(PWMOUT,2)
// PWM3PHH<PWM3PHH0>
extern volatile __bit                   PWM3PHH0            __at(0x6D90);	// @ (0xDB2 * 8 + 0)
#define                                 PWM3PHH0_bit        _BIT_ACCESS(PWM3PHH,0)
// PWM3PHH<PWM3PHH1>
extern volatile __bit                   PWM3PHH1            __at(0x6D91);	// @ (0xDB2 * 8 + 1)
#define                                 PWM3PHH1_bit        _BIT_ACCESS(PWM3PHH,1)
// PWM3PHH<PWM3PHH2>
extern volatile __bit                   PWM3PHH2            __at(0x6D92);	// @ (0xDB2 * 8 + 2)
#define                                 PWM3PHH2_bit        _BIT_ACCESS(PWM3PHH,2)
// PWM3PHH<PWM3PHH3>
extern volatile __bit                   PWM3PHH3            __at(0x6D93);	// @ (0xDB2 * 8 + 3)
#define                                 PWM3PHH3_bit        _BIT_ACCESS(PWM3PHH,3)
// PWM3PHH<PWM3PHH4>
extern volatile __bit                   PWM3PHH4            __at(0x6D94);	// @ (0xDB2 * 8 + 4)
#define                                 PWM3PHH4_bit        _BIT_ACCESS(PWM3PHH,4)
// PWM3PHH<PWM3PHH5>
extern volatile __bit                   PWM3PHH5            __at(0x6D95);	// @ (0xDB2 * 8 + 5)
#define                                 PWM3PHH5_bit        _BIT_ACCESS(PWM3PHH,5)
// PWM3PHH<PWM3PHH6>
extern volatile __bit                   PWM3PHH6            __at(0x6D96);	// @ (0xDB2 * 8 + 6)
#define                                 PWM3PHH6_bit        _BIT_ACCESS(PWM3PHH,6)
// PWM3PHH<PWM3PHH7>
extern volatile __bit                   PWM3PHH7            __at(0x6D97);	// @ (0xDB2 * 8 + 7)
#define                                 PWM3PHH7_bit        _BIT_ACCESS(PWM3PHH,7)
// PWM3INTE<PWM3PHIE>
extern volatile __bit                   PWM3PHIE            __at(0x6DE2);	// @ (0xDBC * 8 + 2)
#define                                 PWM3PHIE_bit        _BIT_ACCESS(PWM3INTE,2)
// PWM3INTF<PWM3PHIF>
extern volatile __bit                   PWM3PHIF            __at(0x6DEA);	// @ (0xDBD * 8 + 2)
#define                                 PWM3PHIF_bit        _BIT_ACCESS(PWM3INTF,2)
// PWM3PHL<PWM3PHL0>
extern volatile __bit                   PWM3PHL0            __at(0x6D88);	// @ (0xDB1 * 8 + 0)
#define                                 PWM3PHL0_bit        _BIT_ACCESS(PWM3PHL,0)
// PWM3PHL<PWM3PHL1>
extern volatile __bit                   PWM3PHL1            __at(0x6D89);	// @ (0xDB1 * 8 + 1)
#define                                 PWM3PHL1_bit        _BIT_ACCESS(PWM3PHL,1)
// PWM3PHL<PWM3PHL2>
extern volatile __bit                   PWM3PHL2            __at(0x6D8A);	// @ (0xDB1 * 8 + 2)
#define                                 PWM3PHL2_bit        _BIT_ACCESS(PWM3PHL,2)
// PWM3PHL<PWM3PHL3>
extern volatile __bit                   PWM3PHL3            __at(0x6D8B);	// @ (0xDB1 * 8 + 3)
#define                                 PWM3PHL3_bit        _BIT_ACCESS(PWM3PHL,3)
// PWM3PHL<PWM3PHL4>
extern volatile __bit                   PWM3PHL4            __at(0x6D8C);	// @ (0xDB1 * 8 + 4)
#define                                 PWM3PHL4_bit        _BIT_ACCESS(PWM3PHL,4)
// PWM3PHL<PWM3PHL5>
extern volatile __bit                   PWM3PHL5            __at(0x6D8D);	// @ (0xDB1 * 8 + 5)
#define                                 PWM3PHL5_bit        _BIT_ACCESS(PWM3PHL,5)
// PWM3PHL<PWM3PHL6>
extern volatile __bit                   PWM3PHL6            __at(0x6D8E);	// @ (0xDB1 * 8 + 6)
#define                                 PWM3PHL6_bit        _BIT_ACCESS(PWM3PHL,6)
// PWM3PHL<PWM3PHL7>
extern volatile __bit                   PWM3PHL7            __at(0x6D8F);	// @ (0xDB1 * 8 + 7)
#define                                 PWM3PHL7_bit        _BIT_ACCESS(PWM3PHL,7)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x6DDC);	// @ (0xDBB * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM3PRH<PWM3PRH0>
extern volatile __bit                   PWM3PRH0            __at(0x6DB0);	// @ (0xDB6 * 8 + 0)
#define                                 PWM3PRH0_bit        _BIT_ACCESS(PWM3PRH,0)
// PWM3PRH<PWM3PRH1>
extern volatile __bit                   PWM3PRH1            __at(0x6DB1);	// @ (0xDB6 * 8 + 1)
#define                                 PWM3PRH1_bit        _BIT_ACCESS(PWM3PRH,1)
// PWM3PRH<PWM3PRH2>
extern volatile __bit                   PWM3PRH2            __at(0x6DB2);	// @ (0xDB6 * 8 + 2)
#define                                 PWM3PRH2_bit        _BIT_ACCESS(PWM3PRH,2)
// PWM3PRH<PWM3PRH3>
extern volatile __bit                   PWM3PRH3            __at(0x6DB3);	// @ (0xDB6 * 8 + 3)
#define                                 PWM3PRH3_bit        _BIT_ACCESS(PWM3PRH,3)
// PWM3PRH<PWM3PRH4>
extern volatile __bit                   PWM3PRH4            __at(0x6DB4);	// @ (0xDB6 * 8 + 4)
#define                                 PWM3PRH4_bit        _BIT_ACCESS(PWM3PRH,4)
// PWM3PRH<PWM3PRH5>
extern volatile __bit                   PWM3PRH5            __at(0x6DB5);	// @ (0xDB6 * 8 + 5)
#define                                 PWM3PRH5_bit        _BIT_ACCESS(PWM3PRH,5)
// PWM3PRH<PWM3PRH6>
extern volatile __bit                   PWM3PRH6            __at(0x6DB6);	// @ (0xDB6 * 8 + 6)
#define                                 PWM3PRH6_bit        _BIT_ACCESS(PWM3PRH,6)
// PWM3PRH<PWM3PRH7>
extern volatile __bit                   PWM3PRH7            __at(0x6DB7);	// @ (0xDB6 * 8 + 7)
#define                                 PWM3PRH7_bit        _BIT_ACCESS(PWM3PRH,7)
// PWM3INTE<PWM3PRIE>
extern volatile __bit                   PWM3PRIE            __at(0x6DE0);	// @ (0xDBC * 8 + 0)
#define                                 PWM3PRIE_bit        _BIT_ACCESS(PWM3INTE,0)
// PWM3INTF<PWM3PRIF>
extern volatile __bit                   PWM3PRIF            __at(0x6DE8);	// @ (0xDBD * 8 + 0)
#define                                 PWM3PRIF_bit        _BIT_ACCESS(PWM3INTF,0)
// PWM3PRL<PWM3PRL0>
extern volatile __bit                   PWM3PRL0            __at(0x6DA8);	// @ (0xDB5 * 8 + 0)
#define                                 PWM3PRL0_bit        _BIT_ACCESS(PWM3PRL,0)
// PWM3PRL<PWM3PRL1>
extern volatile __bit                   PWM3PRL1            __at(0x6DA9);	// @ (0xDB5 * 8 + 1)
#define                                 PWM3PRL1_bit        _BIT_ACCESS(PWM3PRL,1)
// PWM3PRL<PWM3PRL2>
extern volatile __bit                   PWM3PRL2            __at(0x6DAA);	// @ (0xDB5 * 8 + 2)
#define                                 PWM3PRL2_bit        _BIT_ACCESS(PWM3PRL,2)
// PWM3PRL<PWM3PRL3>
extern volatile __bit                   PWM3PRL3            __at(0x6DAB);	// @ (0xDB5 * 8 + 3)
#define                                 PWM3PRL3_bit        _BIT_ACCESS(PWM3PRL,3)
// PWM3PRL<PWM3PRL4>
extern volatile __bit                   PWM3PRL4            __at(0x6DAC);	// @ (0xDB5 * 8 + 4)
#define                                 PWM3PRL4_bit        _BIT_ACCESS(PWM3PRL,4)
// PWM3PRL<PWM3PRL5>
extern volatile __bit                   PWM3PRL5            __at(0x6DAD);	// @ (0xDB5 * 8 + 5)
#define                                 PWM3PRL5_bit        _BIT_ACCESS(PWM3PRL,5)
// PWM3PRL<PWM3PRL6>
extern volatile __bit                   PWM3PRL6            __at(0x6DAE);	// @ (0xDB5 * 8 + 6)
#define                                 PWM3PRL6_bit        _BIT_ACCESS(PWM3PRL,6)
// PWM3PRL<PWM3PRL7>
extern volatile __bit                   PWM3PRL7            __at(0x6DAF);	// @ (0xDB5 * 8 + 7)
